Documents/1st yr/itws/201101153-RitikaTanwani/assignment-01/Report/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Assignment1</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Assignment1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-24 14:21:36 IST"/>
<meta name="author" content="RITIKA TANWANI"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Assignment1</h1>

<dl>
<dt>NAME</dt><dd>RITIKA TANWANI

</dd>
<dt>ROLL NUMBER</dt><dd>201101153
</dd>
</dl>



<p>
Problem 1:
</p>
<p>
<a href="../Codes/1-1.sh">Link :1-1.sh</a>
</p>
<p>
I surfed internet to find how to compare strings ,how to extract tar or gz from a filename and also learnt to use cut command.
</p>


<pre class="example">$&gt; ./1-1.sh itws.tar
Sample Output
a.txt
b.txt
new_folder
...
img_02.jpg
i.e. list of files and directories in itws.tar
</pre>


<p>
<a href="../Codes/1-2.sh">Link :1-2.sh</a>
I searched man pages and internet and came to know about NT and o:order to display pid and process
</p>


<pre class="example">Input
$&gt; ./1-2.sh
Sample output
/usr/bin/firefox 2137
/usr/bin/thunderbird 3451
....
/bin/evince 6792
</pre>


<p>
Problem 2:
</p>
<p>
<a href="../Codes/2-1.sh">Link :2-1.sh</a>
Searched on net to display whole of a string i.e using $* where echo -n command can be implemented using printf statement
</p>


<pre class="example">Sample Input
$prompt&gt; ./2-1.sh hello world program
Output
hello world program$prompt&gt;
</pre>


<p>
<a href="../Codes/2-2.sh">Link :2-2.sh</a>
I searched on net and found the direct command to find maximum memory of a process.
But then I understood the use of each of the flags.
</p>


<pre class="example">$&gt;./2-2.sh
Sample output
/usr/bin/firefox 3421
</pre>


<p>
<a href="../Codes/2-3.sh">Link :2-3.sh</a>
Learnt who command in the class and cut command to extract the column
</p>


<pre class="example">$&gt;./2-3.sh
Sample output
user1
user23
</pre>




<p>
<a href="../Codes/2-4.sh">Link :2-4.sh </a>From man page I found out how not to display matching pattern i.e using grep -v command
</p>


<pre class="example">Input
$&gt;./2-4.sh firefox
Sample Output
0 S user 2950
1 2 80 0 - 141365 poll_s 18:35 ? 00:03:03 /usr/bin/firefox
0 S user 3349 2950 0 80 0 - 13167 poll_s 19:32 ? 00:00:00 /usr/firefox/plugins
0 S user 3351 2950 0 80 0 - 13169 poll_s 19:32 ? 00:00:00 /usr/firefox/plugin/totem

0 S user 4381 3090 0 80 0 - 832 pipe_w 20:31 pts/3 00:00:00 grep firefox
is
5
not present.
</pre>


<p>
Problem 3:
</p>
<p>
<a href="../Codes/3-1.sh">Link :3-1.sh</a>
du-sh finds disk usage and I found the functioning of sort ,and awk to implement the
required process and also  after discussing with friends, I could write the command
</p>


<pre class="example">$&gt;./3-1.sh /home/user/itws2
Sample Output
/home/user/itws2/Book/b.jpg
</pre>





<p>
<a href="../Codes/3-2.sh">Link :3-2.sh</a>
I used man pages to find the functioning of 'find *' command 
and wrote the required command
</p>


<pre class="example">Input
$&gt;./3-2.sh /home/user/work/itws2/assignment
Output
Removed files
a.txt~
assign.org~
</pre>


<p>
<a href="../Codes/3-3.sh">Link :3-3.sh</a>
When a vedio is opened its buffered vedio and  id can be accessed through proc directory
Then we copy the id and store the reqired id on our computer.
</p>



<pre class="example">Sample Execution
$&gt;./3-3.sh myvideo.flv
Sample Output
Video myvideo.flv saved successfully.
</pre>

</div>

<div id="postamble">
<p class="date">Date: 2012-01-24 14:21:36 IST</p>
<p class="author">Author: RITIKA TANWANI</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
